app/views/users/_form.html.erb

SELECT "buildings".* FROM "buildings"
---
    <%= f.label :Which_building_do_you_stay_most_often? %><br />
    <% buildings = Building.all %>