app/views/users/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "8"]]
---
  <%= render 'follows/form'%>
<% elsif @user.followers.include?(User.find(session[:user_id]))  %>