app/views/events/_event.html.erb

        <% if session[:user_id].nil?%>
      <% elsif User.find(session[:user_id]).username == "admin" or event.user_id == session[:user_id] %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]