app/views/events/_form.html.erb

      <%= f.label :Where %><br />
      <%  buildings = Building.all %>
---
SELECT "buildings".* FROM "buildings"