app/views/events/_invite.html.erb

  <%= hidden_field_tag :id, @event.id %>
  <% cu=User.find(session[:user_id])%>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]