app/views/buildings/show.html.erb

    <% if session[:user_id].nil?%>
      <%elsif User.find(session[:user_id]).username == "admin" %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 9]]