app/controllers/admin_controller.rb

  def login
    if request.post?
      user=User.find_by_username(params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'admin1' LIMIT 1