app/controllers/buildings_controller.rb

SELECT "buildings".* FROM "buildings"
---
  def index
    @buildings = Building.all

SELECT "buildings".* FROM "buildings" WHERE "buildings"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @building = Building.find(params[:id])

INSERT INTO "buildings" ("addrln1", "addrln2", "buildname", "city", "created_at", "desc", "lat", "lon", "state", "updated_at", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    require 'net/http'
    @building = Building.new(params[:building])

    uri = "http://maps.google.com/maps/api/geocode/xml?address=" + @building.fulladdress.gsub(' ','+') + "&sensor=false"
    resp = Net::HTTP.get(URI.parse(uri))
    noko_resp = Nokogiri::XML(resp)

    noko_resp.xpath("//GeocodeResponse/result/geometry/location").each do |node|
        #puts node.xpath('lat').inner_text.inspect
        #puts node.xpath('lng').inner_text.inspect
        @building.lat = node.xpath('lat').inner_text
        @building.lon = node.xpath('lng').inner_text
    end


    respond_to do |format|
      if @building.save