app/controllers/events_controller.rb

  def recent
    #@events = Event.all
     @events=Array.new
      @buildings=Array.new

    Event.all.each do |e|
---
SELECT "events".* FROM "events" WHERE (end_time > '2012-08-10 02:19:37.613707') ORDER BY end_time

  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("building_id", "created_at", "desc", "end_time", "eventname", "host", "idcheck", "start_time", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "events" SET "created_at" = '2012-08-10 02:20:07.000000', "start_time" = '2012-08-12 02:19:00.000000', "end_time" = '2012-08-12 02:19:00.000000', "updated_at" = '2012-08-10 02:20:13.531529' WHERE "events"."id" = 2