app/controllers/follows_controller.rb

INSERT INTO "follows" ("created_at", "followed_user_id", "following_user_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 30 Jun 2012 23:25:12 UTC +00:00], ["followed_user_id", 8], ["following_user_id", 9], ["updated_at", Sat, 30 Jun 2012 23:25:12 UTC +00:00]]
---
  def create
    @follow = Follow.new(params[:follow])

    respond_to do |format|
      if @follow.save