app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.all.sort_by {|user| user.followers.count}.reverse

INSERT INTO "users" ("building_id", "created_at", "email", "fname", "lname", "password", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save